[ACT (examination), AIB College of Business, Adrian College, Agnes Scott College, Alaska Pacific University, Albion College, Albright College, Allegheny College, Alma College, Amateur Athletic Union, American University, American football, Amherst College, Andrew College, Annapolis Group, Ashford University, Associated Colleges of the Midwest, Astronaut, Athletic nickname, Augustana College (Illinois), Austin College, Baker University, Baldwin Wallace University, Bard College, Barnard College, Bates College, Beloit College, Bennett College, Bennington College, Berea College, Berry College, Bethune-Cookman University, Birmingham–Southern College, Board of Regents, State of Iowa, Bolt, Beranek and Newman, Boston University, Bowdoin College, Brevard College, Briar Cliff University, Bruce Frohnen, Bryn Mawr College, Bucknell University, Buena Vista University, Burton E. Sweet, California Institute of Technology, Carleton College, Centenary College of Louisiana, Centenary College of New Jersey, Central College (Iowa), Central Methodist University, Centre College, Chair (official), Charles Wesley Flint, Chatham University, Chris Carney, Claflin University, Claremont McKenna College, Clark Atlanta University, Clarke University, Coe College, Colby College, Colgate University, College of Saint Benedict and Saint John's University, College of Wooster, College of the Holy Cross, Collegiate wrestling, Colorado College, Colorado Springs, Colorado, Columbia College (South Carolina), Connecticut College, Cornell University, Dakota Wesleyan University, Dale O. Thomas, David Hilmers, David Loebsack, Davidson College, DePauw University, Deb Mell, Denison University, Des Moines University, Detroit City Council, Dickinson College, Dillard University, Divine Word College, Division III (NCAA), Division I (NCAA), Don E. Fehrenbacher, Dordt College, Drake University, Drew University, Duke University, Earlham College, Eckerd College, Economics, Emmaus Bible College (Iowa), Emmy Award, Emory University, Emory and Henry College, Erwin Kempton Mapes, Ezra Cornell, Fairfield, Iowa, Faith Baptist Bible College and Theological Seminary, Ferrum College, Financial endowment, Florida Southern College, Franklin & Marshall College, Furman University, GPA, Geographic coordinate system, Gettysburg College, Glendale, Arizona, Glenn Cunningham (athlete), Gordon College (Massachusetts), Goucher College, Governor, Graceland University, Grand View University, Green Mountain College, Greensboro College, Grimes Poznikov, Grinnell College, Gustavus Adolphus College, Hamilton College (New York), Hamline University, Hampden–Sydney College, Hampshire College, Harper Reed, Harvey Mudd College, Haverford College, Hendrix College, High Point University, Hiram College, History, Hiwassee College, Hobart and William Smith Colleges, Hollins University, Hope College, Hubert Stanley Wall, Huntingdon College, Huston–Tillotson University, IMDb, Illinois House of Representatives, Illinois Wesleyan University, International Association of Methodist-related Schools, Colleges, and Universities, International Standard Name Identifier, Iowa, Iowa State University, Iowa Wesleyan College, Iowa Wesleyan University, Ithaca, New York, Jack Norris (activist), James Daly (actor), Jim Leach, John Q. Tufts, Joseph M. Bachelor, Juniata College, Kalamazoo College, Kansas Wesleyan University, Kendall College, Kentucky Wesleyan College, Kenyon College, Knox College (Illinois), LaGrange College, Lafayette College, Lake Forest College, Lambuth University, Lawrence University, Lebanon Valley College, Lee Alvin DuBridge, Leo Beranek, Leroy Lamis, Leslie M. Shaw, Lester J. Dickinson, Lewis & Clark College, Liberal arts colleges in the United States, Library of Congress Control Number, Lindsey Wilson College, Lisa Stone, List of colleges and universities in Iowa, Lon Morris College, Loras College, Louisburg College, Luther College (Iowa), Lycoming College, MacMurray College, Macalester College, Maharishi University of Management, Major League Baseball, Manhattan College, Martin Methodist College, Maryann Mahaffey, Mascot, McDaniel College, McKendree University, McMurry University, Medical doctor, Meharry Medical College, Methodist University, Michael J. Graham, Middlebury College, Midwest Conference, Millsaps College, Mock Trial, Monmouth College, Montana State University – Bozeman, Moravian College, Morehouse College, Morningside College, Mount Holyoke College, Mount Mercy University, Mount Vernon, Iowa, Muhlenberg College, NASA, NCAA, National Wrestling Hall of Fame, Nebraska Methodist College, Nebraska Wesleyan University, North Carolina Wesleyan College, North Central College, Northwestern College (Iowa), Northwestern University, Oberlin College, Occidental College, Oglethorpe University, Ohio Northern University, Ohio Wesleyan University, Oklahoma City University, Orin D. Haugen, Otterbein University, Oxford College of Emory University, Paine College, Pfeiffer University, Philander Smith College, Pitzer College, Pomona College, Presbyterian College, President of the United States, Private school, Psychology, Pulitzer Prize for History, Quest University, Ram (sheep), Randolph-Macon College, Randolph College, Randolph–Macon College, Reed College, Reinhardt University, Rhodes College, Richard Nixon, Ripon College (Wisconsin), Rob Ash, Robert Dana, Robert G. Cousins, Rocky Mountain College, Rollins College, Rural area, Rust College, Salem College, Sarah Lawrence College, School colors, Scripps College, Secretary of Treasury, Sewanee: The University of the South, Shenandoah University, Simpson College, Skidmore College, Smith College, Southern Methodist University, Southwestern College (Kansas), Southwestern University, Spanish-American Literature, Spartanburg Methodist College, Spelman College, St. Ambrose University, St. John's College (Annapolis/Santa Fe), St. Lawrence University, St. Olaf College, Stephen D. Schutt, Street performance, Swarthmore College, Sweet Briar College, Syracuse University, Tennessee Wesleyan College, Texas Wesleyan University, Transylvania University, Trinity College (Connecticut), Trinity University (Texas), Tusculum, Tennessee, Tusculum College, Undergraduate education, Union College (Kentucky), Union College (New York), United Methodist Church, United States, University of Denver, University of Dubuque, University of Evansville, University of Indianapolis, University of Iowa, University of Montana - Western, University of Mount Union, University of Northern Iowa, University of Puget Sound, University of the Pacific (United States), University president, Upper Iowa University, Ursinus College, Vassar College, Vegan Outreach, Virginia Wesleyan College, Virtual International Authority File, Volleyball, Wabash College, Waldorf College, Walter Thornton, Wartburg College, Washington & Jefferson College, Washington College, Washington and Lee University, Wellesley College, Wesley College (Delaware), Wesleyan College, Wesleyan University, West Virginia Wesleyan College, Westmont College, Wheaton College (Massachusetts), Whitman College, Whittier College, Wiley College, Willamette University, William Jewell College, William Penn University, William Wallace McCredie, William Wesley Cornell, Williams College, Wittenberg University, Wofford College, Xavier University (Cincinnati), Young Harris College, Jonathan Brand, Wikipedia:Citation needed, Template talk:Annapolis Group, Template talk:Associated Colleges of the Midwest, Template talk:Colleges and universities in Iowa, Template talk:MethodistColleges, Help:Authority control]
